
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = []
my_family = ['Батя','Кошанский', 'Бурун']
# список списков приблизителного роста членов вашей семьи
my_family_height = [
    # ['имя', рост],
    [],
]
my_family_height = [['Батя', 173],
['Кошанский', 163],
['Бурун', 30]]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см
Рост_бати= '173 см'
# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
Общий_рост=Батя+Кошанский+Бурун
Общий_рост_моей_семьи='366 см'
я потратил на эту залупу около 4х часов на решение, задача супер кривая и не логичная,
поэтому пошла она нахуй, пиздец жопа горит. Уверен, что есть нормальное решение,
о котором конечно этот пидор не рассказал на лекции